<template>
  <main class="flex-grow">
    <div
      class="rules pt-[211px] pb-[144px] md:pb-[120px] sm:pb-[80px] md:pt-[93px] xsm:pt-[79px] min-h-screen rounded-t-[70px] sm:rounded-t-[44px] bg-dark-700"
    >
      <div class="container">
        <h2
          class="section-title text-center mb-[25px] md:mb-[26px] xsm:mb-[30px]"
        >
          Нужно знать
        </h2>
        <h3
          class="section-subtitle text-center mb-[60px] md:mb-[26px] xsm:mb-[30px]"
        >
          Все что вам нужно знать о нашем сервисе!
        </h3>
      </div>
      <SectionFaq
        class="rounded-t-[70px] bg-transparent sm:rounded-t-[44px]"
        :questions="questions"
        title="НУЖНО ЗНАТЬ"
        subTitle="Все что вам нужно знать о нашем сервисе!"
      ></SectionFaq>
    </div>
  </main>
</template>

<script setup>
const questions = ref([
  {
    title:
      "Что делать если я попал в ДТП, а виноват местный. Как договариваться?",
    text: "Важно понимать, что если на Бали происходит дорожное происшествие без серьезного ущерба здоровью, никто не вызывает полицейскую службу и все расходятся полюбовно. В случае конфликтной ситуации на дороге, - самое главное не паниковать и уведомить владельца или компанию по аренде, для скорейшей помощи и решения ситуации.",
  },
  {
    title: "Какие основные штрафы за нарушение ПДД есть на Бали?",
    text: "Пересечение СТОП-ЛИНИИ на красном сигнале светофора -  штраф от 500.000 до 1.000.000 IDR<br>Управление байком без шлема - штраф от 250.000 до 500.000 IDR<br>Пассажир на байке без шлема - штраф от 250.000 до 500.000 IDR<br>Передвижение на байке втроем - штраф от 250.000 до 500.000 IDR<br>Управление байком без МВУ (категория 'А') штраф от 1.000.000 до 1.500.000 IDR.",
  },
  {
    title: "Нужны ли права для аренды байка?",
    text: "Мы не требуем от Вас наличие категории А в водительском удостоверении.Но учтите, что по закону наличие прав для вождения байка с соответствующей категорией обязательно.",
  },
  {
    title: "Что делать, если меня остановила полиция, а прав нет?",
    text: "Если у вас нет прав, то мы советуем откладывать 100 тысяч рупий отдельно в карман для таких ситуаций чтобы оперативно на нейтрально-позитивной волне решать вопрос маленьким пожертвованием полицейским.",
  },

  {
    title: "Можно ли ездить по острову с правами другой страны?",
    text: "Если Ваши водительские права нового образца - пластик и с переводом на английский язык, то они котируются в Индонезии. При возможности желательно сделать международные права( книжечка) перед отлетом, так как даже при наличии прав нового образца полиция может захотеть облегчить ваши карманы.",
  },
  {
    title: "Можно ли сделать местные права?",
    text: "На данный момент можно получить только туристические права, которые будут действовать год по всей Индонезии. Выдают их в полиции без каких либо тестов, обращайтесь и мы поделимся с вами контактом.",
  },
  {
    title: "Каким бензином лучше всего заправляться и где это делать?",
    text: "На Бали есть только одна сеть заправок - Pertamania. Вам нужен Pertamax(92) синего цвета. Бензин также можно приобрести практически в любом районе у местных, но он будет дороже, чем на заправке. Они выставляют стеклянные бутылки вдоль дороги или маленькую колонку при своем магазине.",
  },
]);
</script>

<style lang="sass"></style>
