<template>
  <main class="flex-grow">
    <div class="rules min-h-screen pt-[160px] md:pt-[100px] sm:pt-[70px] rounded-t-[70px] sm:rounded-t-[44px] bg-dark-700">
      <SectionFaq class="rounded-t-[70px] bg-transparent sm:rounded-t-[44px]" :questions="questions" title="НУЖНО ЗНАТЬ" subTitle="Все что вам нужно знать о нашем сервисе!"></SectionFaq>
    </div>
  </main>
</template>

<script setup>
const questions = ref([
  {
    title: "Как долго вы доставляете байк?",
    text: "Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации.",
  },
  {
    title: "Как долго вы доставляете байк?",
    text: "Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации.",
  },
  {
    title: "Как долго вы доставляете байк?",
    text: "Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации.",
  },
  {
    title: "Как долго вы доставляете байк?",
    text: "Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации.",
  },

  {
    title: "Как долго вы доставляете байк?",
    text: "Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации.",
  },
  {
    title: "Как долго вы доставляете байк?",
    text: "Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не получается при простой дубликации.",
  },
])
</script>

<style lang="sass"></style>
