<template>
  <section class="oferta">
    <h1>Условия аренды</h1>
    <div>
      <br />
      <h2 class="subhead pt-[18px]">
        1. СРОК АРЕНДЫ И УСЛОВИЯ БРОНИРОВАНИЯ / ОПЛАТЫ
      </h2>
      <br />1.1 Минимальный срок аренды транспорта в нашей компании начинается
      от X дней. Мы можем предоставить транспортное средство на меньший период,
      однако стоимость услуги будет идентична аренде за Х дней. <br />1.2 Срок
      аренды транспортного средства определяется исходя из выбранных дат и
      количества дней аренды на сайте baligo.bike и указывается в договоре
      аренды при получении транспортного средства. О необходимости продления
      срока аренды необходимо уведомлять минимум за 48 часов до даты возврата
      транспортного средства. Если используемое клиентом транспортное средство
      уже забронировано на последующие даты, мы предложим альтернативную замену,
      если таковая будет в наличии. Стоимость продления по-умолчанию
      рассчитывается из стандартных расценок нашего сервиса. <br />1.3 Оплата
      аренды должна быть осуществлена в полном объеме непосредственно во время
      бронирования на сайте baligo.bike либо во время доставки, при получении
      транспортного средства на острове Бали. Оплата производится наличными в
      долларах США (USD), евро (EURO), австралийских долларах (AUD),
      индонезийских рупиях (IDR) и других валютах по текущему курсу. <br />1.4
      Если вы обратились к нам, уже будучи на острове Бали или не успели
      предварительно забронировать необходимое транспортное средство мы
      постараемся оперативно доставить выбранную модель по факту обращения, если
      она есть в наличии или же предложим подходящую альтернативу. <br />1.5 При
      досрочном завершении аренды по инициативе клиента мы возвращаем 50% от
      стоимости оставшегося срока аренды транспортного средства. Возврат
      денежных средств невозможен в следующих случаях:
      <ul class="list-disc pl-[27px]">
        <li>При аренде на минимальный срок (Х дней)</li>
        <li>
          При аренде на длительный срок (до 30 дней) с фиксированной стоимостью,
          если текущий срок аренды до отмены составил более 12 дней.
        </li>
      </ul>
      <h2 class="subhead uppercase">
        2. Водительские права и политика доставки/возврата
      </h2>
      <br />2.1 Официально на территории Индонезии для управления транспортным
      средством необходимо иметь при себе действующее международное водительское
      удостоверение с соответствующей категорией. <br />2.2 В стоимость аренды
      нашей техники включены бесплатная доставка и возврат при выполнении
      следующих условий: <br />
      <ul class="list-disc pl-[27px]">
        <li>
          Время доставки и возврата находится в пределах от 9 до 19:00 по Бали.
        </li>
        <li>
          Арендатор должен предоставить локацию для доставки / возврата, удобное
          время и другие детали не позднее чем за 24 часа.
        </li>
        <li>
          Место доставки и возврата должно находиться в пределах 25 км езды от
          офиса нашей компании, расположенной в районе Чангу (Canggu). В зону
          бесплатной доставки попадают следующие районы Бали: Кута, Семиньяк,
          Керобокан, Чангу, Нуса Дуа, Джимбаран, Санур, Букит, южная часть
          Убуда, Денпасар
        </li>
      </ul>

      2.3 Для уточнения возможности и стоимости доставки в отдаленные районы
      (Амед, Чандидаса, Ловина, Балиан, Медеви, северный Убуд) или для доставки
      / возврата в часы, не совпадающие с работой нашего офиса пожалуйста
      проконсультируйтесь заранее с нашими менеджерами. <br />2.4 Если у
      арендатора нет возможности осуществить возврат транспортного средства
      лично, необходимо заранее уведомить нашего менеджера для согласования
      процедуры возврата. <br />
      <h2 class="subhead">
        3. СТРАХОВКА ТРАНСПОРТНОГО СРЕДСТВА И ОТВЕТСТВЕННОСТЬ КЛИЕНТА
      </h2>
      <br />3.1 Наша компания предоставляет бесплатную опцию с полной страховкой
      от повреждений в результате дтп / падения и угона транспортного средства
      на всю мототехнику (скутеры и мотоциклы). <br />
      3.2 Страховка на мототехнику не покрывает ущерб в следующих случаях:
      <ul class="list-disc pl-[55px] sm:pl-[25px]">
        <li>
          Повреждение покрышек вследствие прокола или пореза по вине арендатора,
          ответственность по устранению повреждений (заклеить, накачать
          покрышку) несет арендатор. Если покрышка требует замены по причине
          износа (нет маркировки, стерт протектор, сама покрышка разорвана), то
          это ответственность нашей компании.
        </li>
        <li>
          Необходимая замена аккумулятора по причине его полной разрядки по вине
          арендатора (включенные фары, габариты и т.д.).
        </li>
        <li>Умышленная порча транспортного средства.</li>
        <li>
          Использование транспортного средства при выезде с дорог общего
          пользования (например, пляж, горы, поле, джунгли и т.д.).
        </li>
      </ul>
      3.3 В случае инцидента, при котором пострадало арендованное транспортное
      средство клиент обязан известить арендодателя в течение 24 часов с момента
      аварии и предоставить необходимую информацию. Если необходимая информация
      не была предоставлена в отведенный срок арендатор берет на себя всю
      ответственность за повреждения. <br />3.4 Запрещено ремонтировать
      арендованное ТС самостоятельно или в любом сервисе (включая официальных
      дилеров) без разрешения со стороны арендодателя. Наша компания не будет
      покрывать расходы на ремонт, выполненный без согласования, а также вправе
      наложить штраф на арендатора в размере 100 USD + сумма нанесенного ущерба.
      <br />3.5 Арендатор несет полную ответственность в случае нанесения ущерба
      третьей стороне в результате инцидента. <br />3.6 Арендатор несет полную
      ответственность за транспортное средство и любые последствия, вызванные
      передачей транспортного средства третьему лицу, не указанному в договоре
      аренды. <br />3.7 Арендатор несет полную ответственность за любой ущерб
      транспортного средства при выезде с дорог общего пользования (например,
      пляж, горы, поле, джунгли и т.д.). <br />3.8 В случае утери или
      значительных повреждений мото шлема арендатор обязан возместить стоимость
      покупки нового аналога, чтобы следующему клиенту достался также отличный
      шлем. <br />3.9 В случае потери ключа от транспортного средства арендатор
      обязан возместить стоимость восстановления нового аналога. <br />3.10 Все
      арендуемые автомобили и мототехника предоставляются вместе с оригиналом
      регистрации транспортного средства, в случае утери документов с клиента
      взимается штраф 80$. <br />3.11 В случае, если арендатор нарушает условия
      данного соглашения, арендодатель имеет право немедленно забрать
      транспортное средство без возмещения стоимости аренды. <br />3.12 Наша
      компания не несет ответственности за ущерб, убытки, травмы и смерть,
      нанесенные арендатору или арендатором другим участникам движения,
      водителям или пассажирам, участвующим в авариях. Арендодатель не несет
      ответственности за неспособность выполнить свои обязательства вызванную
      проблемами, находящимися вне разумного контроля компании, включая, помимо
      прочего, административные действия, пожар, наводнение, эпидемию, войну,
      беспорядки и терроризм. Наша компания не несет ответственности за
      какие-либо нелегальные действия или действия против закона Республики
      Индонезия. <br />
      <h2 class="subhead uppercase">4. Дополнительные услуги и возможности</h2>
      <br />4.1 Мы предлагаем ежедневную техническую поддержку с 9:00 до 20:00
      на Бали. Эта услуга бесплатна, если проблема с оборудованием возникла не
      по вашей вине. Стоимость услуги, в случае ошибки с вашей стороны,
      составляет 25 долларов США. <br />4.2 С любым арендованным велосипедом
      предоставляются два шлема в хорошем состоянии. Совершенно новые шлемы
      доступны по запросу за плату в размере 10 долларов США. Шлемы для детей
      предоставляются по запросу без дополнительной оплаты. Пожалуйста, сообщите
      менеджеру заранее, если требуется размер шлема S, M или L. В случае, если
      шлем не подойдет, будет предоставлена ​​бесплатная замена. <br />
      <h2 class="subhead">5. ОГРАНИЧЕНИЯ И ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</h2>
      <br />5.1 Переоформление заключенного договора на другого арендатора с
      сохранением текущих сроков аренды возможно за дополнительную плату 20$.
      <br />5.2 Вся предоставляемые в аренду транспортные средства в нашей
      компании сдаются без ограничения по пробегу. <br />5.3 На арендуемой
      технике запрещено покидать пределы острова Бали.
    </div>
  </section>
</template>

<script setup></script>

<style lang="sass"></style>
